public class lesson_08_02 {
    //Целые типы
    //В языке Java аж 4 целых типа: byte, short, int и long. Они отличаются размером и диапазоном значений, которые могут хранить.
    //Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
    //Этим переменным присвой максимально возможное для них значение.
    //Никаких методов создавать не нужно.
    byte a1 = 127;
    short b1 = 32767;
    int c1 = 2147483647;
    long d1 = 9223372036854775807L;

    //Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
    //Этим переменным присвой минимально возможное для них значение.
    //Никаких методов создавать не нужно.
    byte a2 = -128;
    short b2 = -32768;
    int c2 = -2147483648;
    long d2 = -9223372036854775808L;
}
