public class lesson_08_19 {
    //Абстракция

    //Абстракция — это использование только тех характеристик объекта,
    //которые с достаточной точностью представляют его в программе.
    //Основная идея состоит в том, чтобы представить объект минимальным набором
    //полей и методов и при этом с достаточной точностью для решаемой задачи.
    //
    //В языке программирования Java абстракция осуществляется через использование абстрактных классов и интерфейсов.

    //С точки зрения же программирования, абстракция — это, скажем так, правильное разделение программы на объекты.
    //Обычно любую большую программу можно десятками способов представить в виде взаимодействующих объектов.
    //Абстракция позволяет отобрать главные характеристики и опустить второстепенные.
}
