public class lesson_08_21 {
    //Наследование

    //Наследование — это специальное отношение между двумя классами
    //В программировании тоже есть возможность создавать один класс на основе другого.
    //Новый класс становится потомком (наследником) уже существующего. Это очень выгодно,
    //когда есть класс, который содержит 80%-90% нужных нам данных и методов.
    //Мы просто объявляем подходящий класс родителем нашего нового класса,
    //и в новом классе автоматически появляются все данные и методы класса-родителя
}
