public class lesson_08_08 {
    //Приведение типов в Java
    //Переменные примитивных типов (за исключением типа boolean) используются для хранения разных типов чисел.
    //И хоть типы переменных всегда неизменны, есть место, где можно проводить преобразование типов. И место это — присваивание.
    //Можно присваивать друг другу переменные разных типов. При этом значение, взятое из переменной одного типа,
    //будет преобразовано в значение другого типа и присвоено второй переменной.
    //В связи с этим можно выделить два вида преобразования типов: расширение и сужение.

    //Расширение типа похоже на перекладывание из маленькой корзинки в большую — операция проходит незаметно и безболезненно.

    //Сужение типа — это перекладывание из большой корзинки в маленькую: места может не хватить, и что-то придётся выбросить.

}
