public class lesson_08_20 {
    //Инкапсуляция

    //Цель инкапсуляции — улучшить качество взаимодействия вещей за счет их упрощения.

    //С точки зрения программирования, инкапсуляция — это «сокрытие реализации».
    //Наш класс может содержать сотни методов и реализовывать очень сложное поведение в различных ситуациях.
    //Но мы можем скрыть от посторонних глаз все его методы (пометить модификатором private),
    //а для взаимодействия с другими классами оставить всего пару-тройку методов (пометить их модификатором public).
    //Тогда все остальные классы нашей программы будут видеть в этом классе всего три метода и вызывать именно их.
    //А все сложности будут скрыты внутри класса
}
